<?php

/**************************** Rutas Privadas **********************************/
Route::group(['middleware' => ['auth','acceso']], function (){
 	
	Route::resource('periodo', 'PeriodoController');

});
/**************************** Rutas Privadas **********************************/
/*----------------------------------------------------------------------------*/
/*************************** Rutas Protegidas *********************************/
Route::group(['middleware' => 'auth'], function (){

 	Route::get('/home', 'HomeController@index')->name('home');

});
/*************************** Rutas Protegidas *********************************/
/*----------------------------------------------------------------------------*/
/**************************** Rutas Públicas **********************************/
Auth::routes();

Route::get('/', function () { return view('welcome'); });
/**************************** Rutas Públicas **********************************/
